; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared1 - mode
	thermograph0 - mode
	infrared2 - mode
	Star2 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 Star5)
	(have_image Star6 thermograph0)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 infrared1)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon10 thermograph0)
	(have_image Planet11 infrared2)
	(have_image Phenomenon12 infrared1)
	(have_image Star13 infrared1)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 infrared2)
	(have_image Phenomenon16 infrared2)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 13
2. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 13
3. (turn_to satellite2 phenomenon15 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon15)
   goals met: 0 of 13
4. (take_image satellite2 phenomenon15 instrument5 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 1 of 13
5. (turn_to satellite2 phenomenon14 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 13
6. (take_image satellite2 phenomenon14 instrument5 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 2 of 13
7. (turn_to satellite2 phenomenon12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 13
8. (take_image satellite2 phenomenon12 instrument5 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 3 of 13
9. (turn_to satellite2 phenomenon10 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 13
10. (turn_to satellite1 star5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star5)
   goals met: 4 of 13
11. (turn_to satellite0 star5 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star5)
   goals met: 5 of 13
12. (take_image satellite2 phenomenon10 instrument5 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 6 of 13
13. (turn_to satellite2 phenomenon16 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon16)
   goals met: 6 of 13
14. (take_image satellite2 phenomenon16 instrument5 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 7 of 13
15. (turn_to satellite2 phenomenon8 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon8)
   goals met: 7 of 13
16. (take_image satellite2 phenomenon8 instrument5 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 8 of 13
17. (turn_to satellite2 phenomenon9 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon9)
   goals met: 8 of 13
18. (take_image satellite2 phenomenon9 instrument5 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 9 of 13
19. (turn_to satellite2 planet11 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet11)
   goals met: 9 of 13
20. (take_image satellite2 planet11 instrument5 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 10 of 13
21. (turn_to satellite2 planet7 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet7)
   goals met: 10 of 13
22. (take_image satellite2 planet7 instrument5 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 11 of 13
23. (turn_to satellite2 star13 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star13)
   goals met: 11 of 13
24. (take_image satellite2 star13 instrument5 infrared1)
   added: (have_image star13 infrared1)
   goals met: 12 of 13
25. (turn_to satellite2 star6 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star6)
   goals met: 12 of 13
26. (take_image satellite2 star6 instrument5 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 13 of 13
